OpenFOAM-2112/WeirWithAMI/MeshA/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    (-15 -5 -10)
    (-0.4 -5 -10)
    (-0.4  5 -10)
    (-15  5 -10)

    (-15 -5 8)
    (-0.4 -5 8)
    (-0.4  5 8)
    (-15  5 8)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (37 25 45) simpleGrading (1 1 1)
);

edges
(
);

patches
(
    wall sides
    (
        (0 1 5 4)
        (2 3 7 6)
    )
    wall bottom
    (
        (0 3 2 1)
    )
    patch lid
    (
        (4 5 6 7)
    )
    patch inlet
    (
        (0 4 7 3)
    )
    patch amiAA
    (
        (1 2 6 5)
    )
);

mergePatchPairs
(
);

// ************************************************************************* //
