OpenFOAM-2112/WeirWithAMI/MeshA/constant/dynamicMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1806                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      dynamicMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dynamicFvMesh   dynamicMotionSolverFvMesh;

motionSolverLibs ("libfvMotionSolvers.so");

motionSolver     displacementLayeredMotion;

cellZone        gateZone;

displacementLayeredMotionCoeffs {
    regions {
        gateZone {
            interpolationScheme linear;
            boundaryField {
                gateFloorFaceZone {
                    type follow;
                }
                gateLipFaceZone {
                    type follow;
                }
            }
        }
    }
}


// ************************************************************************* //
