OpenFOAM-2112/WeirWithAMI/MeshA/0.model/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include        "include/initialConditions"

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    inlet
    {
        type            variableHeightFlowRateInletUniformVelocity;
        alpha           alpha.water;
        value           uniform (0 0 0);
    }
    outlet
    {
        type            inletOutlet;
        inletValue      uniform (0 0 0);
        value           uniform (0 0 0);
    }
    "(spillway|piles)"
    {
        type            noSlip;
    }
    "(sides|bottom|gateLip|gateFloor|gateSides)"
    {
        type            slip;
    }
    lid
    {
        type            pressureInletOutletVelocity;
        value           uniform (0 0 0);
    }

    ".*blockage"
    {
        type            noSlip;
    }
    ".*couple"
    {
        type            cyclicACMI;
        value           uniform (0 0 0);
    }
}

// ************************************************************************* //
