OpenFOAM-2112/WeirWithAMI/MeshA/0.model/omega
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include        "include/initialConditions"

dimensions      [0 0 -1 0 0 0 0];

internalField   uniform $turbulentOmega;

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    inlet
    {
        type            fixedValue;
        value           $internalField;
    }
    outlet
    {
        type            inletOutlet;
        inletValue      $internalField;
        value           $internalField;
    }
    "(spillway|piles)"
    {
        type            omegaWallFunction;
        value           $internalField;
    }
    "(sides|bottom|gateLip|gateFloor|gateSides)"
    {
        type            zeroGradient;
    }
    lid
    {
        type            inletOutlet;
        inletValue      $internalField;
        value           $internalField;
    }

    ".*blockage"
    {
        type            zeroGradient;
    }
    ".*couple"
    {
        type            cyclicACMI;
        value           uniform 0;
    }
}


// ************************************************************************* //
