OpenFOAM-2112/WeirWithAMI/MeshA/0.model/pointDisplacement
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2112                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       pointVectorField;
    object      pointDisplacement;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    "(inlet|outlet|spillway|piles|sides|bottom|lid)"
    {
        type            uniformFixedValue;
        uniformValue    (0 0 0);
    }

    gateFloor
    {
        type            uniformFixedValue;
        uniformValue    (0 0 0);
    }

    gateLip
    {
        type            uniformFixedValue;
        uniformValue    table (
            (0  (0 0 0))
            (5  (0 0 5))
            (10 (0 0 5))
        );
    }

    gateSides
    {
        type            fixedNormalSlip;
        n               (0 1 0);
    }

    "ami12.*"
    {
        type            fixedNormalSlip;
        n               (1 0 0);
    }
    "ami21.*"
    {
        type            fixedNormalSlip;
        n               (1 0 0);
    }

    "ami11.*"
    {
        type            uniformFixedValue;
        uniformValue    (0 0 0);
    }
    "ami22.*"
    {
        type            uniformFixedValue;
        uniformValue    (0 0 0);
    }
}


// ************************************************************************* //
