OpenFOAM-2112/WeirWithAMI/MeshA/system/createBafflesDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1806                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      createBafflesDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Whether to convert internal faces only (so leave boundary faces intact).
// This is only relevant if your face selection type can pick up boundary
// faces.
internalFacesOnly false;


// Baffles to create.
baffles
{
    // NOTE: cyclicAMI patches MUST BE defined PRIOR to their associted
    //       blockage patches

    ami12
    {
        //- Use predefined faceZone to select faces and orientation.
        type        faceZone;
        zoneName    amiABFaces;

        patches
        {
            master
            {
                //- Master side patch
                name            ami12_couple;
                type            cyclicACMI;
                matchTolerance  0.0001;
                neighbourPatch  ami11_couple;
                nonOverlapPatch ami12_blockage;
                transform       noOrdering;
            }
            slave // not used since we're manipulating a boundary patch
            {
                //- Slave side patch
                name            ami12_couple;
                type            patch;
            }

            master2
            {
                //- Master side patch
                name            ami12_blockage;
                type            wall;
            }
            slave2 // not used since we're manipulating a boundary patch
            {
                //- Slave side patch
                name            ami12_blockage;
                type            wall;
            }

        }
    }
    ami11
    {
        //- Use predefined faceZone to select faces and orientation.
        type        faceZone;
        zoneName    amiAAFaces;

        patches
        {
            master
            {
                //- Master side patch
                name            ami11_couple;
                type            cyclicACMI;
                matchTolerance  0.0001;
                neighbourPatch  ami12_couple;
                nonOverlapPatch ami11_blockage;
                transform       noOrdering;
            }
            slave // not used since we're manipulating a boundary patch
            {
                //- Slave side patch
                name            ami11_couple;
                type            patch;
            }

            master2
            {
                //- Master side patch
                name            ami11_blockage;
                type            wall;
            }
            slave2 // not used since we're manipulating a boundary patch
            {
                //- Slave side patch
                name            ami11_blockage;
                type            wall;
            }
        }
    }
















    ami21
    {
        //- Use predefined faceZone to select faces and orientation.
        type        faceZone;
        zoneName    amiBAFaces;

        patches
        {
            master
            {
                //- Master side patch
                name            ami21_couple;
                type            cyclicACMI;
                matchTolerance  0.0001;
                neighbourPatch  ami22_couple;
                nonOverlapPatch ami21_blockage;
                transform       noOrdering;
            }
            slave // not used since we're manipulating a boundary patch
            {
                //- Slave side patch
                name            ami21_couple;
                type            patch;
            }

            master2
            {
                //- Master side patch
                name            ami21_blockage;
                type            wall;
            }
            slave2 // not used since we're manipulating a boundary patch
            {
                //- Slave side patch
                name            ami21_blockage;
                type            wall;
            }

        }
    }
    ami22
    {
        //- Use predefined faceZone to select faces and orientation.
        type        faceZone;
        zoneName    amiBBFaces;

        patches
        {
            master
            {
                //- Master side patch
                name            ami22_couple;
                type            cyclicACMI;
                matchTolerance  0.0001;
                neighbourPatch  ami21_couple;
                nonOverlapPatch ami22_blockage;
                transform       noOrdering;
            }
            slave // not used since we're manipulating a boundary patch
            {
                //- Slave side patch
                name            ami22_couple;
                type            patch;
            }

            master2
            {
                //- Master side patch
                name            ami22_blockage;
                type            wall;
            }
            slave2 // not used since we're manipulating a boundary patch
            {
                //- Slave side patch
                name            ami22_blockage;
                type            wall;
            }
        }
    }
}


// ************************************************************************* //
